Revit 2027 API
ElementType.CanBeDeleted Property
 Determine if this ElementType can be deleted
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeDeleted { get; }
Public ReadOnly Property CanBeDeleted As Boolean
	Get
public:
property bool CanBeDeleted {
	bool get ();
}
member CanBeDeleted : bool with get
Property Value
Boolean
See Also
Reference
ElementType Class
Autodesk.Revit.DB Namespace